/** ЗАДАЧА 25 - Выражение или инструкция
 *
 * Определите тип каждой конструкции JavaScript:
 *  - выражение (expression)
 *  - инструкция (statement)
 *  - выражение-инструкция (expression statement)
 */

//выражение-инструкция
15

//выражение-инструкция, тк создается объект со значениями его свойств
//неправильно, верно - инструкция
const myObject = {
  x: 10,
  y: true,
}

//выражение-инструкция, так как объявляется новое свойство объекта и ему присваивается значение
//правильно
myObject.z = 'abc'

//инструкция
//неправильно, верно - выражение-инструкция
delete myObject.x

//выражение
//правильно
let newVariable

//инструкция
//неправильно, выражение-инструкция. Выражение будет только "30 + 5"
newVariable = 30 + 5

//хз
//верно - выражение инструкция. Выражение будет только "newVariable"
console.log(newVariable)

// statement
if (newVariable > 10) {
  /**       ^
   *    expression
   */

  // expression statement
  console.log(`${newVariable} больше 10`) // <-- newVariable is expression
  /**         _________________________
   *                      ^
   *                 expression
   */
}
