/** ЗАДАЧА 55 - Деструктуризация результата функции
 *
 * 1. Создайте функцию "minMax", которая принимает любое количество аргументов
 *
 * 2. Эта функция должна возвращать массив из двух элементов:
 *  - Первый элемент массива - минимальное значение среди всех аргументов.
 *  - Второй элемент массива - это максимальное значение среди всех аргументов.
 */

let min, max
/* Вызовите здесь функцию "minMax" с аргументами 24, 5, 34, 10
и используя деструктуризацию массивов присвойте значения переменным "min" и "max" */

function minMax(...arg) {
   let maxValue = Math.max.apply(null, arg)
   let minValue = Math.min.apply(null, arg)
   max = maxValue
   min = minValue

   return console.log([min, max])
}

console.log(minMax(24, 5, 34, 10))

/* Вызовите здесь функцию "minMax" еще раз с аргументами 18, 23, 103, 70, 80, 25 */
console.log(minMax(18, 23, 103, 70, 80, 25)) // 18, 103
